zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211fxx_ca35.h
/******************  Bit definition for CRYP_IV1RR register  ******************/
#define CRYP_IV1RR_IVI_Pos              (0U)
#define CRYP_IV1RR_IVI_Msk              (0xFFFFFFFFUL << CRYP_IV1RR_IVI_Pos)       /*!< 0xFFFFFFFF */
#define CRYP_IV1RR_IVI                  CRYP_IV1RR_IVI_Msk                        /*!< Initialization vector bit x (x&#160;=&#160; 31 to 0) */

/***************  Bit definition for CRYP_CSGCMCCM0R register  ****************/
#define CRYP_CSGCMCCM0R_CSGCMCCM_Pos    (0U)
#define CRYP_CSGCMCCM0R_CSGCMCCM_Msk    (0xFFFFFFFFUL << CRYP_CSGCMCCM0R_CSGCMCCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCMCCM0R_CSGCMCCM        CRYP_CSGCMCCM0R_CSGCMCCM_Msk              /*!< Context swap for GCM/GMAC and CCM modes */

/***************  Bit definition for CRYP_CSGCMCCM1R register  ****************/
#define CRYP_CSGCMCCM1R_CSGCMCCM_Pos    (0U)
#define CRYP_CSGCMCCM1R_CSGCMCCM_Msk    (0xFFFFFFFFUL << CRYP_CSGCMCCM1R_CSGCMCCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCMCCM1R_CSGCMCCM        CRYP_CSGCMCCM1R_CSGCMCCM_Msk              /*!< Context swap for GCM/GMAC and CCM modes */

/***************  Bit definition for CRYP_CSGCMCCM2R register  ****************/
#define CRYP_CSGCMCCM2R_CSGCMCCM_Pos    (0U)
#define CRYP_CSGCMCCM2R_CSGCMCCM_Msk    (0xFFFFFFFFUL << CRYP_CSGCMCCM2R_CSGCMCCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCMCCM2R_CSGCMCCM        CRYP_CSGCMCCM2R_CSGCMCCM_Msk              /*!< Context swap for GCM/GMAC and CCM modes */

/***************  Bit definition for CRYP_CSGCMCCM3R register  ****************/
#define CRYP_CSGCMCCM3R_CSGCMCCM_Pos    (0U)
#define CRYP_CSGCMCCM3R_CSGCMCCM_Msk    (0xFFFFFFFFUL << CRYP_CSGCMCCM3R_CSGCMCCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCMCCM3R_CSGCMCCM        CRYP_CSGCMCCM3R_CSGCMCCM_Msk              /*!< Context swap for GCM/GMAC and CCM modes */

/***************  Bit definition for CRYP_CSGCMCCM4R register  ****************/
#define CRYP_CSGCMCCM4R_CSGCMCCM_Pos    (0U)
#define CRYP_CSGCMCCM4R_CSGCMCCM_Msk    (0xFFFFFFFFUL << CRYP_CSGCMCCM4R_CSGCMCCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCMCCM4R_CSGCMCCM        CRYP_CSGCMCCM4R_CSGCMCCM_Msk              /*!< Context swap for GCM/GMAC and CCM modes */

/***************  Bit definition for CRYP_CSGCMCCM5R register  ****************/
#define CRYP_CSGCMCCM5R_CSGCMCCM_Pos    (0U)
#define CRYP_CSGCMCCM5R_CSGCMCCM_Msk    (0xFFFFFFFFUL << CRYP_CSGCMCCM5R_CSGCMCCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCMCCM5R_CSGCMCCM        CRYP_CSGCMCCM5R_CSGCMCCM_Msk              /*!< Context swap for GCM/GMAC and CCM modes */

/***************  Bit definition for CRYP_CSGCMCCM6R register  ****************/
#define CRYP_CSGCMCCM6R_CSGCMCCM_Pos    (0U)
#define CRYP_CSGCMCCM6R_CSGCMCCM_Msk    (0xFFFFFFFFUL << CRYP_CSGCMCCM6R_CSGCMCCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCMCCM6R_CSGCMCCM        CRYP_CSGCMCCM6R_CSGCMCCM_Msk              /*!< Context swap for GCM/GMAC and CCM modes */

/***************  Bit definition for CRYP_CSGCMCCM7R register  ****************/
#define CRYP_CSGCMCCM7R_CSGCMCCM_Pos    (0U)
#define CRYP_CSGCMCCM7R_CSGCMCCM_Msk    (0xFFFFFFFFUL << CRYP_CSGCMCCM7R_CSGCMCCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCMCCM7R_CSGCMCCM        CRYP_CSGCMCCM7R_CSGCMCCM_Msk              /*!< Context swap for GCM/GMAC and CCM modes */

/*****************  Bit definition for CRYP_CSGCM0R register  *****************/
#define CRYP_CSGCM0R_CSGCM_Pos          (0U)
#define CRYP_CSGCM0R_CSGCM_Msk          (0xFFFFFFFFUL << CRYP_CSGCM0R_CSGCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCM0R_CSGCM              CRYP_CSGCM0R_CSGCM_Msk                    /*!< Context swap for GCM/GMAC modes */

/*****************  Bit definition for CRYP_CSGCM1R register  *****************/
#define CRYP_CSGCM1R_CSGCM_Pos          (0U)
#define CRYP_CSGCM1R_CSGCM_Msk          (0xFFFFFFFFUL << CRYP_CSGCM1R_CSGCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCM1R_CSGCM              CRYP_CSGCM1R_CSGCM_Msk                    /*!< Context swap for GCM/GMAC modes */

/*****************  Bit definition for CRYP_CSGCM2R register  *****************/
#define CRYP_CSGCM2R_CSGCM_Pos          (0U)
#define CRYP_CSGCM2R_CSGCM_Msk          (0xFFFFFFFFUL << CRYP_CSGCM2R_CSGCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCM2R_CSGCM              CRYP_CSGCM2R_CSGCM_Msk                    /*!< Context swap for GCM/GMAC modes */

/*****************  Bit definition for CRYP_CSGCM3R register  *****************/
#define CRYP_CSGCM3R_CSGCM_Pos          (0U)
#define CRYP_CSGCM3R_CSGCM_Msk          (0xFFFFFFFFUL << CRYP_CSGCM3R_CSGCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCM3R_CSGCM              CRYP_CSGCM3R_CSGCM_Msk                    /*!< Context swap for GCM/GMAC modes */

/*****************  Bit definition for CRYP_CSGCM4R register  *****************/
#define CRYP_CSGCM4R_CSGCM_Pos          (0U)
#define CRYP_CSGCM4R_CSGCM_Msk          (0xFFFFFFFFUL << CRYP_CSGCM4R_CSGCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCM4R_CSGCM              CRYP_CSGCM4R_CSGCM_Msk                    /*!< Context swap for GCM/GMAC modes */

/*****************  Bit definition for CRYP_CSGCM5R register  *****************/
#define CRYP_CSGCM5R_CSGCM_Pos          (0U)
#define CRYP_CSGCM5R_CSGCM_Msk          (0xFFFFFFFFUL << CRYP_CSGCM5R_CSGCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCM5R_CSGCM              CRYP_CSGCM5R_CSGCM_Msk                    /*!< Context swap for GCM/GMAC modes */

/*****************  Bit definition for CRYP_CSGCM6R register  *****************/
#define CRYP_CSGCM6R_CSGCM_Pos          (0U)
#define CRYP_CSGCM6R_CSGCM_Msk          (0xFFFFFFFFUL << CRYP_CSGCM6R_CSGCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCM6R_CSGCM              CRYP_CSGCM6R_CSGCM_Msk                    /*!< Context swap for GCM/GMAC modes */

/*****************  Bit definition for CRYP_CSGCM7R register  *****************/
#define CRYP_CSGCM7R_CSGCM_Pos          (0U)
#define CRYP_CSGCM7R_CSGCM_Msk          (0xFFFFFFFFUL << CRYP_CSGCM7R_CSGCM_Pos)   /*!< 0xFFFFFFFF */
#define CRYP_CSGCM7R_CSGCM              CRYP_CSGCM7R_CSGCM_Msk                    /*!< Context swap for GCM/GMAC modes */

/*****************  Bit definition for CRYP_HWCFGR register  ******************/
#define CRYP_HWCFGR_CFG1_Pos            (0U)
#define CRYP_HWCFGR_CFG1_Msk            (0xFUL << CRYP_HWCFGR_CFG1_Pos)            /*!< 0x0000000F */
#define CRYP_HWCFGR_CFG1                CRYP_HWCFGR_CFG1_Msk                      /*!< Hardware Generic 1 */
#define CRYP_HWCFGR_CFG2_Pos            (4U)
#define CRYP_HWCFGR_CFG2_Msk            (0xFUL << CRYP_HWCFGR_CFG2_Pos)            /*!< 0x000000F0 */
#define CRYP_HWCFGR_CFG2                CRYP_HWCFGR_CFG2_Msk                      /*!< Hardware Generic 2 */
#define CRYP_HWCFGR_CFG3_Pos            (8U)
#define CRYP_HWCFGR_CFG3_Msk            (0xFUL << CRYP_HWCFGR_CFG3_Pos)            /*!< 0x00000F00 */
#define CRYP_HWCFGR_CFG3                CRYP_HWCFGR_CFG3_Msk                      /*!< Hardware Generic 3 */
#define CRYP_HWCFGR_CFG4_Pos            (12U)
#define CRYP_HWCFGR_CFG4_Msk            (0xFUL << CRYP_HWCFGR_CFG4_Pos)            /*!< 0x0000F000 */
#define CRYP_HWCFGR_CFG4                CRYP_HWCFGR_CFG4_Msk                      /*!< Hardware Generic 4 */

