zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211fxx_ca35.h
/* Bit fields for PWR_CPU2D2SR register */
#define PWR_CPU2D2SR_HOLD_BOOT_Pos             (0U)
#define PWR_CPU2D2SR_HOLD_BOOT_Msk             (0x1UL << PWR_CPU2D2SR_HOLD_BOOT_Pos)
#define PWR_CPU2D2SR_HOLD_BOOT                 PWR_CPU2D2SR_HOLD_BOOT_Msk  /*!< CPU2 HOLD_BOOT status flag.Set by hardware to indicate when the CPU2 is in HOLD_BOOT state.- 0: CPU2 is allowed to boot.- 1: CPU2 is maintained in HOLD_BOOT state by hardware.Refer to RCC specification for details on HOLD_BOOT processor state. */
#define PWR_CPU2D2SR_WFBEN_Pos                 (1U)
#define PWR_CPU2D2SR_WFBEN_Msk                 (0x1UL << PWR_CPU2D2SR_WFBEN_Pos)
#define PWR_CPU2D2SR_WFBEN                     PWR_CPU2D2SR_WFBEN_Msk  /*!< CPU2 Wait for boot enable status flag.Set by hardware to indicate when the CPU2 is in wait for boot enable state. Only applicable in Wakeup event mode.- 0: CPU2 is not in wait for boot enable state. Set at â0â in legacy boot mode.- 1: CPU2 is in wait for boot enable state. It will start once an event assign to him will be raised.Refer to RCC specification for details on HOLD_BOOT processor state. */
#define PWR_CPU2D2SR_CSTATE_Pos                (2U)
#define PWR_CPU2D2SR_CSTATE_Msk                (0x3UL << PWR_CPU2D2SR_CSTATE_Pos)
#define PWR_CPU2D2SR_CSTATE                    PWR_CPU2D2SR_CSTATE_Msk  /*!< CPU2 cluster state status flag.Set by hardware to indicate when the CPU2 is in CRun, CSleep or CStop states.- 00: CPU2 is in reset (Hold_boot or Wfben).- 01: CPU2 is in CRun state.- 10: CPU2 is in CSleep state.- 11: CPU2 is in CStop state. */
#define PWR_CPU2D2SR_DSTATE_Pos                (8U)
#define PWR_CPU2D2SR_DSTATE_Msk                (0x7UL << PWR_CPU2D2SR_DSTATE_Pos)
#define PWR_CPU2D2SR_DSTATE                    PWR_CPU2D2SR_DSTATE_Msk  /*!< System / D2 state status.Set by hardware to indicate when the system / D2 domain is in Run, Stop, LP-Stop, LPLV-Stop, Standby and VBAT modes.- 000: Run- 001: Stop- 010: LP-Stop- 011: LPLV-Stop- 100: Standby- 101: VBAT */


/* Bit fields for PWR_VERR register */
#define PWR_VERR_MINREV_Pos                    (0U)
#define PWR_VERR_MINREV_Msk                    (0xfUL << PWR_VERR_MINREV_Pos)
#define PWR_VERR_MINREV                        PWR_VERR_MINREV_Msk  /*!< Minor revision number. */
#define PWR_VERR_MAJREV_Pos                    (4U)
#define PWR_VERR_MAJREV_Msk                    (0xfUL << PWR_VERR_MAJREV_Pos)
#define PWR_VERR_MAJREV                        PWR_VERR_MAJREV_Msk  /*!< Major revision number. */

/* Bit fields for PWR_IPIDR register */
#define PWR_IPIDR_ID_Pos                       (0U)
#define PWR_IPIDR_ID_Msk                       (0xffffffffUL << PWR_IPIDR_ID_Pos)
#define PWR_IPIDR_ID                           PWR_IPIDR_ID_Msk  /*!< Identifier of the PWR */

/* Bit fields for PWR_SIDR register */
#define PWR_SIDR_SID_Pos                       (0U)
#define PWR_SIDR_SID_Msk                       (0xffffffffUL << PWR_SIDR_SID_Pos)
#define PWR_SIDR_SID                           PWR_SIDR_SID_Msk  /*!< Decoding space is 1 KB */

/******************************************************************************/
/*                                                                            */
/*                      SRAMs configuration controller                        */
/*                                                                            */
/******************************************************************************/
/****************  Bit definition for RAMCFG_*RAM_CR registers  ***************/
#define RAMCFG_CR_ECCE_Pos                  (0U)
#define RAMCFG_CR_ECCE_Msk                  (0x1UL << RAMCFG_CR_ECCE_Pos)           /*!< 0x00000001 */
#define RAMCFG_CR_ECCE                      RAMCFG_CR_ECCE_Msk                      /*!< ECC Enable */
#define RAMCFG_CR_ALE_Pos                   (4U)
#define RAMCFG_CR_ALE_Msk                   (0x1UL << RAMCFG_CR_ALE_Pos)            /*!< 0x00000010 */
#define RAMCFG_CR_ALE                       RAMCFG_CR_ALE_Msk                       /*!< Address Latch Enable */
#define RAMCFG_CR_SRAMER_Pos                (8U)
#define RAMCFG_CR_SRAMER_Msk                (0x1UL << RAMCFG_CR_SRAMER_Pos)         /*!< 0x00000100 */
#define RAMCFG_CR_SRAMER                    RAMCFG_CR_SRAMER_Msk                    /*!< SRAM Erase */
#define RAMCFG_CR_SRAMHWERDIS_Pos           (12U)
#define RAMCFG_CR_SRAMHWERDIS_Msk           (0x1UL << RAMCFG_CR_SRAMHWERDIS_Pos)    /*!< 0x00001000 */
#define RAMCFG_CR_SRAMHWERDIS               RAMCFG_CR_SRAMHWERDIS_Msk               /*!< SRAM Hardware Erase Disable */

/***************  Bit definition for RAMCFG_*RAM_IER registers  ***************/
#define RAMCFG_IER_SEIE_Pos                 (0U)
#define RAMCFG_IER_SEIE_Msk                 (0x1UL << RAMCFG_IER_SEIE_Pos)          /*!< 0x00000001 */
#define RAMCFG_IER_SEIE                     RAMCFG_IER_SEIE_Msk                     /*!< ECC Single Error Interrupt Enable */
#define RAMCFG_IER_DEIE_Pos                 (1U)
#define RAMCFG_IER_DEIE_Msk                 (0x1UL << RAMCFG_IER_DEIE_Pos)          /*!< 0x00000002 */
#define RAMCFG_IER_DEIE                     RAMCFG_IER_DEIE_Msk                     /*!< ECC Double Error Interrupt Enable */

/****************  Bit definition for RAMCFG_*RAM_ISR registers  **************/
#define RAMCFG_ISR_SEC_Pos                  (0U)
#define RAMCFG_ISR_SEC_Msk                  (0x1UL << RAMCFG_ISR_SEC_Pos)           /*!< 0x00000001 */
#define RAMCFG_ISR_SEC                      RAMCFG_ISR_SEC_Msk                      /*!< ECC Single Error Corrected */
#define RAMCFG_ISR_DED_Pos                  (1U)
#define RAMCFG_ISR_DED_Msk                  (0x1UL << RAMCFG_ISR_DED_Pos)           /*!< 0x00000002 */
#define RAMCFG_ISR_DED                      RAMCFG_ISR_DED_Msk                      /*!< ECC Double Error Detected */
#define RAMCFG_ISR_SRAMBUSY_Pos             (8U)
#define RAMCFG_ISR_SRAMBUSY_Msk             (0x1UL << RAMCFG_ISR_SRAMBUSY_Pos)      /*!< 0x00000100 */
#define RAMCFG_ISR_SRAMBUSY                 RAMCFG_ISR_SRAMBUSY_Msk                 /*!< SRAM busy with erase operation */

/***************  Bit definition for RAMCFG_RETRAM.SEAR register  *************/
#define RAMCFG_SEAR_ESEA_Pos                (0U)
#define RAMCFG_RETRAM_SEAR_ESEA_Msk         (0x7FFFUL << RAMCFG_SEAR_ESEA_Pos)      /*!< 0x00007FFF */
#define RAMCFG_RETRAM_SEAR_ESEA             RAMCFG_RETRAM_SEAR_ESEA_Msk             /*!< ECC Single Error Address */
/**************  Bit definition for RAMCFG_BKPSRAM.SEAR register  *************/
#define RAMCFG_BKPSRAM_SEAR_ESEA_Msk        (0x7FFUL << RAMCFG_SEAR_ESEA_Pos)       /*!< 0x000007FF */
#define RAMCFG_BKPSRAM_SEAR_ESEA            RAMCFG_BKPSRAM_SEAR_ESEA_Msk            /*!< ECC Single Error Address */

/***************  Bit definition for RAMCFG_RETRAM.DEAR register  *************/
#define RAMCFG_DEAR_EDEA_Pos                (0U)
#define RAMCFG_RETRAM_DEAR_EDEA_Msk         (0x7FFFUL << RAMCFG_DEAR_EDEA_Pos)      /*!< 0x00007FFF */
#define RAMCFG_RETRAM_DEAR_EDEA             RAMCFG_RETRAM_DEAR_EDEA_Msk             /*!< ECC Double Error Address */
/**************  Bit definition for RAMCFG_BKPSRAM.SEAR register  *************/
#define RAMCFG_BKPSRAM_DEAR_EDEA_Msk        (0x7FFUL << RAMCFG_DEAR_EDEA_Pos)       /*!< 0x000007FF */
#define RAMCFG_BKPSRAM_DEAR_EDEA            RAMCFG_BKPSRAM_DEAR_EDEA_Msk            /*!< ECC Double Error Address */

/****************  Bit definition for RAMCFG_*RAM_ICR registers  **************/
#define RAMCFG_ICR_CSEC_Pos                 (0U)
#define RAMCFG_ICR_CSEC_Msk                 (0x1UL << RAMCFG_ICR_CSEC_Pos)          /*!< 0x00000001 */
#define RAMCFG_ICR_CSEC                     RAMCFG_ICR_CSEC_Msk                     /*!< Clear ECC Single Error Corrected */
#define RAMCFG_ICR_CDED_Pos                 (1U)
#define RAMCFG_ICR_CDED_Msk                 (0x1UL << RAMCFG_ICR_CDED_Pos)          /*!< 0x00000002 */
#define RAMCFG_ICR_CDED                     RAMCFG_ICR_CDED_Msk                     /*!< Clear ECC Double Error Detected */

/**************  Bit definition for RAMCFG_*RAM_ECCKEYR registers  ************/
#define RAMCFG_ECCKEYR_ECCKEY_Pos           (0U)
#define RAMCFG_ECCKEYR_ECCKEY_Msk           (0xFFUL << RAMCFG_ECCKEYR_ECCKEY_Pos)   /*!< 0x000000FF */
#define RAMCFG_ECCKEYR_ECCKEY               RAMCFG_ECCKEYR_ECCKEY_Msk               /*!< ECC Write Protection Key */

/**************  Bit definition for RAMCFG_*RAM_ERKEYR registers  *************/
#define RAMCFG_ERKEYR_ERASEKEY_Pos          (0U)
#define RAMCFG_ERKEYR_ERASEKEY_Msk          (0xFFUL << RAMCFG_ERKEYR_ERASEKEY_Pos)  /*!< 0x000000FF */
#define RAMCFG_ERKEYR_ERASEKEY              RAMCFG_ERKEYR_ERASEKEY_Msk              /*!< Erase Write Protection Key */

/***************  Bit definition for RAMCFG_*RAM_CCR1 registers  **************/
#define RAMCFG_CCR1_CRCC_Pos                (0U)
#define RAMCFG_CCR1_CRCC_Msk                (0x3UL << RAMCFG_CCR1_CRCC_Pos)         /*!< 0x00000003 */
#define RAMCFG_CCR1_CRCC                    RAMCFG_CCR1_CRCC_Msk                    /*!< CRC configuration */
#define RAMCFG_CCR1_CRCBS_Pos               (4U)
#define RAMCFG_CCR1_CRCBS_Msk               (0x7UL << RAMCFG_CCR1_CRCBS_Pos)        /*!< 0x00000070 */
#define RAMCFG_CCR1_CRCBS                   RAMCFG_CCR1_CRCBS_Msk                   /*!< CRC Buffer Size */

/***************  Bit definition for RAMCFG_*RAM_CCR2 registers  **************/
#define RAMCFG_CCR2_CRCCS_Pos               (0U)
#define RAMCFG_CCR2_CRCCS_Msk               (0x1UL << RAMCFG_CCR2_CRCCS_Pos)        /*!< 0x00000001 */
#define RAMCFG_CCR2_CRCCS                   RAMCFG_CCR2_CRCCS_Msk                   /*!< CRC computation start */
#define RAMCFG_CCR2_CRCFC_Pos               (31U)
#define RAMCFG_CCR2_CRCFC_Msk               (0x1UL << RAMCFG_CCR2_CRCFC_Pos)        /*!< 0x80000000 */
#define RAMCFG_CCR2_CRCFC                   RAMCFG_CCR2_CRCFC_Msk                   /*!< CRC flags clear */

/****************  Bit definition for RAMCFG_*_CRSR registers  ****************/
#define RAMCFG_CRSR_CRCRS_Pos               (0U)
#define RAMCFG_CRSR_CRCRS_Msk               (0xFFFFFFFFUL << RAMCFG_CRSR_CRCRS_Pos) /*!< 0xFFFFFFFF */
#define RAMCFG_CRSR_CRCRS                   RAMCFG_CRSR_CRCRS_Msk                   /*!< CRC reference signature */

/*****************  Bit definition for RAMCFG_*_CSR registers  ****************/
#define RAMCFG_CSR_CRCEOC_Pos               (0U)
#define RAMCFG_CSR_CRCEOC_Msk               (0x1UL << RAMCFG_CSR_CRCEOC_Pos)        /*!< 0x00000001 */
#define RAMCFG_CSR_CRCEOC                   RAMCFG_CSR_CRCEOC_Msk                   /*!< CRC End Of Computation flag */
#define RAMCFG_CSR_CRCSCS_Pos               (1U)
#define RAMCFG_CSR_CRCSCS_Msk               (0x1UL << RAMCFG_CSR_CRCSCS_Pos)        /*!< 0x00000002 */
#define RAMCFG_CSR_CRCSCS                   RAMCFG_CSR_CRCSCS_Msk                   /*!< CRC Signature Check Status flag */

