zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211fxx_ca35.h
/* Bit fields for RCC_PLL7CFGR3 register */
#define RCC_PLL7CFGR3_FRACIN_Pos                   (0U)
#define RCC_PLL7CFGR3_FRACIN_Msk                   (0xFFFFFFUL << RCC_PLL7CFGR3_FRACIN_Pos)             /*!< 0x00FFFFFF */
#define RCC_PLL7CFGR3_FRACIN                       RCC_PLL7CFGR3_FRACIN_Msk                          /*!< Fractional part of PLLy VCO multiplication factor */
#define RCC_PLL7CFGR3_DOWNSPREAD_Pos               (24U)
#define RCC_PLL7CFGR3_DOWNSPREAD_Msk               (0x1UL << RCC_PLL7CFGR3_DOWNSPREAD_Pos)              /*!< 0x01000000 */
#define RCC_PLL7CFGR3_DOWNSPREAD                   RCC_PLL7CFGR3_DOWNSPREAD_Msk                      /*!< PLLy VCO frequency modulation mode */
#define RCC_PLL7CFGR3_DACEN_Pos                    (25U)
#define RCC_PLL7CFGR3_DACEN_Msk                    (0x1UL << RCC_PLL7CFGR3_DACEN_Pos)                   /*!< 0x02000000 */
#define RCC_PLL7CFGR3_DACEN                        RCC_PLL7CFGR3_DACEN_Msk                           /*!< PLLy noise canceling DAC enable in fractional mode */
#define RCC_PLL7CFGR3_SSCGDIS_Pos                  (26U)
#define RCC_PLL7CFGR3_SSCGDIS_Msk                  (0x1UL << RCC_PLL7CFGR3_SSCGDIS_Pos)                 /*!< 0x04000000 */
#define RCC_PLL7CFGR3_SSCGDIS                      RCC_PLL7CFGR3_SSCGDIS_Msk                         /*!< PLLy spread-spectrum modulator disable */

/* Bit fields for RCC_PLL7CFGR4 register */
#define RCC_PLL7CFGR4_DSMEN_Pos                    (8U)
#define RCC_PLL7CFGR4_DSMEN_Msk                    (0x1UL << RCC_PLL7CFGR4_DSMEN_Pos)                   /*!< 0x00000100 */
#define RCC_PLL7CFGR4_DSMEN                        RCC_PLL7CFGR4_DSMEN_Msk                           /*!< PLLy delta-sigma modulator enable */
#define RCC_PLL7CFGR4_FOUTPOSTDIVEN_Pos            (9U)
#define RCC_PLL7CFGR4_FOUTPOSTDIVEN_Msk            (0x1UL << RCC_PLL7CFGR4_FOUTPOSTDIVEN_Pos)           /*!< 0x00000200 */
#define RCC_PLL7CFGR4_FOUTPOSTDIVEN                RCC_PLL7CFGR4_FOUTPOSTDIVEN_Msk                   /*!< PLLy output and post dividers enable */
#define RCC_PLL7CFGR4_BYPASS_Pos                   (10U)
#define RCC_PLL7CFGR4_BYPASS_Msk                   (0x1UL << RCC_PLL7CFGR4_BYPASS_Pos)                  /*!< 0x00000400 */
#define RCC_PLL7CFGR4_BYPASS                       RCC_PLL7CFGR4_BYPASS_Msk                          /*!< PLLy FOUTPOSTDIV bypass */

/* Bit fields for RCC_PLL7CFGR5 register */
#define RCC_PLL7CFGR5_DIVVAL_Pos                   (0U)
#define RCC_PLL7CFGR5_DIVVAL_Msk                   (0xFUL << RCC_PLL7CFGR5_DIVVAL_Pos)                  /*!< 0x0000000F */
#define RCC_PLL7CFGR5_DIVVAL                       RCC_PLL7CFGR5_DIVVAL_Msk                          /*!< Modulation frequency adjustment for PLLy */
#define RCC_PLL7CFGR5_SPREAD_Pos                   (16U)
#define RCC_PLL7CFGR5_SPREAD_Msk                   (0x1FUL << RCC_PLL7CFGR5_SPREAD_Pos)                 /*!< 0x001F0000 */
#define RCC_PLL7CFGR5_SPREAD                       RCC_PLL7CFGR5_SPREAD_Msk                          /*!< Modulation depth adjustment for PLLy */

/* Bit fields for RCC_PLL7CFGR6 register */
#define RCC_PLL7CFGR6_POSTDIV1_Pos                 (0U)
#define RCC_PLL7CFGR6_POSTDIV1_Msk                 (0x7UL << RCC_PLL7CFGR6_POSTDIV1_Pos)                /*!< 0x00000007 */
#define RCC_PLL7CFGR6_POSTDIV1                     RCC_PLL7CFGR6_POSTDIV1_Msk                        /*!< PLLy VCO frequency divide level 1 */

/* Bit fields for RCC_PLL7CFGR7 register */
#define RCC_PLL7CFGR7_POSTDIV2_Pos                 (0U)
#define RCC_PLL7CFGR7_POSTDIV2_Msk                 (0x7UL << RCC_PLL7CFGR7_POSTDIV2_Pos)                /*!< 0x00000007 */
#define RCC_PLL7CFGR7_POSTDIV2                     RCC_PLL7CFGR7_POSTDIV2_Msk                        /*!< PLLy VCO frequency divide level 2 */

/* Bit fields for RCC_PLL8CFGR1 register */
#define RCC_PLL8CFGR1_SSMODRST_Pos                 (0U)
#define RCC_PLL8CFGR1_SSMODRST_Msk                 (0x1UL << RCC_PLL8CFGR1_SSMODRST_Pos)                /*!< 0x00000001 */
#define RCC_PLL8CFGR1_SSMODRST                     RCC_PLL8CFGR1_SSMODRST_Msk                        /*!< PLLy spread-spectrum modulator reset */
#define RCC_PLL8CFGR1_PLLEN_Pos                    (8U)
#define RCC_PLL8CFGR1_PLLEN_Msk                    (0x1UL << RCC_PLL8CFGR1_PLLEN_Pos)                   /*!< 0x00000100 */
#define RCC_PLL8CFGR1_PLLEN                        RCC_PLL8CFGR1_PLLEN_Msk                           /*!< PLLy enable */
#define RCC_PLL8CFGR1_PLLRDY_Pos                   (24U)
#define RCC_PLL8CFGR1_PLLRDY_Msk                   (0x1UL << RCC_PLL8CFGR1_PLLRDY_Pos)                  /*!< 0x01000000 */
#define RCC_PLL8CFGR1_PLLRDY                       RCC_PLL8CFGR1_PLLRDY_Msk                          /*!< PLLy clock ready flag */
#define RCC_PLL8CFGR1_CKREFST_Pos                  (28U)
#define RCC_PLL8CFGR1_CKREFST_Msk                  (0x1UL << RCC_PLL8CFGR1_CKREFST_Pos)                 /*!< 0x10000000 */
#define RCC_PLL8CFGR1_CKREFST                      RCC_PLL8CFGR1_CKREFST_Msk                         /*!< PLLy reference clock state */

/* Bit fields for RCC_PLL8CFGR2 register */
#define RCC_PLL8CFGR2_FREFDIV_Pos                  (0U)
#define RCC_PLL8CFGR2_FREFDIV_Msk                  (0x3FUL << RCC_PLL8CFGR2_FREFDIV_Pos)                /*!< 0x0000003F */
#define RCC_PLL8CFGR2_FREFDIV                      RCC_PLL8CFGR2_FREFDIV_Msk                         /*!< PLLy reference input clock divide frequency ratio */
#define RCC_PLL8CFGR2_FBDIV_Pos                    (16U)
#define RCC_PLL8CFGR2_FBDIV_Msk                    (0xFFFUL << RCC_PLL8CFGR2_FBDIV_Pos)                 /*!< 0x0FFF0000 */
#define RCC_PLL8CFGR2_FBDIV                        RCC_PLL8CFGR2_FBDIV_Msk                           /*!< PLLy VCO multiplication factor */

/* Bit fields for RCC_PLL8CFGR3 register */
#define RCC_PLL8CFGR3_FRACIN_Pos                   (0U)
#define RCC_PLL8CFGR3_FRACIN_Msk                   (0xFFFFFFUL << RCC_PLL8CFGR3_FRACIN_Pos)             /*!< 0x00FFFFFF */
#define RCC_PLL8CFGR3_FRACIN                       RCC_PLL8CFGR3_FRACIN_Msk                          /*!< Fractional part of PLLy VCO multiplication factor */
#define RCC_PLL8CFGR3_DOWNSPREAD_Pos               (24U)
#define RCC_PLL8CFGR3_DOWNSPREAD_Msk               (0x1UL << RCC_PLL8CFGR3_DOWNSPREAD_Pos)              /*!< 0x01000000 */
#define RCC_PLL8CFGR3_DOWNSPREAD                   RCC_PLL8CFGR3_DOWNSPREAD_Msk                      /*!< PLLy VCO frequency modulation mode */
#define RCC_PLL8CFGR3_DACEN_Pos                    (25U)
#define RCC_PLL8CFGR3_DACEN_Msk                    (0x1UL << RCC_PLL8CFGR3_DACEN_Pos)                   /*!< 0x02000000 */
#define RCC_PLL8CFGR3_DACEN                        RCC_PLL8CFGR3_DACEN_Msk                           /*!< PLLy noise canceling DAC enable in fractional mode */
#define RCC_PLL8CFGR3_SSCGDIS_Pos                  (26U)
#define RCC_PLL8CFGR3_SSCGDIS_Msk                  (0x1UL << RCC_PLL8CFGR3_SSCGDIS_Pos)                 /*!< 0x04000000 */
#define RCC_PLL8CFGR3_SSCGDIS                      RCC_PLL8CFGR3_SSCGDIS_Msk                         /*!< PLLy spread-spectrum modulator disable */

